sentervip/nrf52832sdk15.0.0/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/tutorial_ble_app_uart/main.c
}
int SpiRead(uint8_t *pData, uint8_t len )
{
	ret_code_t iRet;
	SPI_CS_L;
	iRet = nrf_drv_spi_transfer(&Spi0, 0, 0, pData, len);
	//nrf_delay_us( 2 * len + 10);
	nrf_delay_us( len*2+100 ); //len=50
	SPI_CS_H;
    if(iRet != NRF_SUCCESS){
	    printf("spi read failed");
	}
	return iRet;
}

int SpiWrite(uint8_t *pData,uint16_t len)
{
	ret_code_t iRet;
	SPI_CS_L;
	iRet = nrf_drv_spi_transfer(&Spi0,  pData, len, NULL, 0);
	nrf_delay_us(20); //12
	SPI_CS_H;
	if(iRet != NRF_SUCCESS){
	    printf("spi write failed");
	}
	return iRet;
}


/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{
    static unsigned int g_cnt;
    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        
        //NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);

       // for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
       // {
            do
            {
							
				//add for z1 by aizj  get cmd start captrue
				if(p_evt->params.rx_data.p_data[0] == 'E' && p_evt->params.rx_data.p_data[1] == 'F'){		
		
					//parse pressure data level
					uint8_t j =0,i=6;
					int8_t p[] = ",";
					char * data = NULL;
					
					data = strtok((char*)&p_evt->params.rx_data.p_data[2], p);
					while( data != NULL && i--){					
						g_levelData[0][j] = atoi(data);		
						data = strtok(NULL, p);
						j++;	
					}
					//NRF_LOG_INFO("ble cmd[%d,%d,%d,%d,%d,%d]",g_levelData[0][0],g_levelData[0][1],\
					g_levelData[0][2],g_levelData[0][3],g_levelData[0][4],g_levelData[0][5]);
					
					//start capture
	#ifdef Z1_RTP
					captrue_cmd(RESET_ALL);
					captrue_cmd(START_CAP);
	#else				
					captrue_cmd(RESET_ALL);
					captrue_cmd(ENABLE_ADC);
	#endif
					return;
					
								 // FPGA_READ_CS_L;										
								 // g_FPGAReadyFlg = 0;	
								  //saadc_sampling_event_enable();								  
								  //g_CapFlag = 1;		
				//stop captrue
				}else if(p_evt->params.rx_data.p_data[0] == 'E' && p_evt->params.rx_data.p_data[1] == 'E'){	
						captrue_cmd(STOP_CAP);
						return;
				}
								 //end z1
								 
                //err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                //if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                //{
                //    NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                //    
				//	APP_ERROR_CHECK(err_code);
                //}
            } while (err_code == NRF_ERROR_BUSY);
       // }
        //if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
        //{
        //    while (app_uart_put('\n') == NRF_ERROR_BUSY);
        //}
    }
	
	
	return ; //aizj add 
	
	
	
	  uint32_t err_code;
		uint16_t length;
		 	 
	  length = m_ble_nus_max_data_len;
	  if (p_evt->type == BLE_NUS_EVT_TX_RDY)
		{
#ifdef METHOD2			
			err_code = ble_nus_data_send(&m_nus, m_data_array, &length, m_conn_handle);
			if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
					 (err_code != NRF_ERROR_NOT_FOUND) )
			{
					APP_ERROR_CHECK(err_code);
			}
			if (err_code == NRF_SUCCESS)
			{			
				m_len_sent += length; 	
				m_data_array[0]++;
				m_data_array[length-1]++;	
			}
			NRF_LOG_INFO("time: %d *10ms == bytes send: %d Bytes == avg speed: %d B/s",m_cnt_10ms,m_len_sent,m_len_sent * 100/m_cnt_10ms);	
#endif

#ifdef METHOD2_PLUS
			//queue multiple tx array
			do
			{					
					err_code = ble_nus_data_send(&m_nus, m_data_array, &length, m_conn_handle);
					if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
							 (err_code != NRF_ERROR_NOT_FOUND) )
					{
							APP_ERROR_CHECK(err_code);
					}
					if (err_code == NRF_SUCCESS)
					{
						m_len_sent += length; 	
						m_data_array[0]++;
						m_data_array[length-1]++;	
					}
			} while (err_code == NRF_SUCCESS);	
			if(g_cnt++ %100 == 0)
				NRF_LOG_INFO("time: %d *10ms == bytes send: %d Bytes == avg speed: %d B/s\n",m_cnt_10ms,m_len_sent,m_len_sent * 100/m_cnt_10ms);	
#endif			
			
