sentervip/nrf52832sdk15.0.0/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/tutorial_ble_app_uart/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;  

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    UNUSED_RETURN_VALUE(NRF_LOG_PROCESS());
    nrf_pwr_mgmt_run();
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}


static void throughput_timer_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
#ifdef	METHOD1
	  ret_code_t err_code;
	  uint16_t length;
	  m_cnt_7ms++;
	  length = m_ble_nus_max_data_len;
	  if (m_conn_handle != BLE_CONN_HANDLE_INVALID)
		{
			err_code = ble_nus_data_send(&m_nus, m_data_array, &length, m_conn_handle);
//			if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
//					 (err_code != NRF_ERROR_NOT_FOUND) )
//			{
//					APP_ERROR_CHECK(err_code);
//			}	
      if (err_code == NRF_SUCCESS)
			{
				m_len_sent += length; 	
				m_data_array[0]++;
				m_data_array[length-1]++;				
			}
	
		}
		NRF_LOG_INFO("time: %d *7ms == bytes send: %d Bytes == avg speed: %d B/s",m_cnt_7ms,m_len_sent,(m_len_sent * 1000)/(m_cnt_7ms*7));
#endif
#ifdef	METHOD1_PLUS
	  ret_code_t err_code;
	  uint16_t length;
	  m_cnt_7ms++;
	  length = m_ble_nus_max_data_len;		
			do
			{					
					err_code = ble_nus_data_send(&m_nus, m_data_array, &length, m_conn_handle);
					if ( (err_code != NRF_ERROR_INVALID_STATE) && (err_code != NRF_ERROR_RESOURCES) &&
							 (err_code != NRF_ERROR_NOT_FOUND) )
					{
							APP_ERROR_CHECK(err_code);
					}
					if (err_code == NRF_SUCCESS)
					{
						m_len_sent += length; 	
						m_data_array[0]++;
						m_data_array[length-1]++;						
					}
						
			} while (err_code == NRF_SUCCESS);
		NRF_LOG_INFO("time: %d *7ms == bytes send: %d Bytes == avg speed: %d B/s",m_cnt_7ms,m_len_sent,(m_len_sent * 1000)/(m_cnt_7ms*7));	
#endif	
#if defined (METHOD2) || defined (METHOD2_PLUS)			
    m_cnt_10ms++;
#endif
		
}

void throughput_test()
{
	ret_code_t err_code;
	app_timer_create(&m_timer_speed, APP_TIMER_MODE_REPEATED, throughput_timer_handler);  

#ifdef EVT_LEN_EXT_ON
	  ble_opt_t  opt;
    memset(&opt, 0x00, sizeof(opt));
    opt.common_opt.conn_evt_ext.enable = true;
    err_code = sd_ble_opt_set(BLE_COMMON_OPT_CONN_EVT_EXT, &opt);
    APP_ERROR_CHECK(err_code);
#endif	
	
}
void captrue_cmd(uint8_t type)
{
	switch(type){
		case DISABLE_ADC:
			g_str_app_adc.locked = ENABLE;
			nrf_drv_timer_disable(&g_str_app_adc.timer);	
			break;
		case ENABLE_ADC:
			g_str_app_adc.locked = DISABLE;
			nrf_drv_timer_enable(&g_str_app_adc.timer);		
			break;				
		case RESET_ALL:
			FPGA_READ_CS_H;		
			g_CapFlag = 0;	
			g_FPGAReadyFlg = 0;	
			nrf_drv_timer_disable(&g_str_app_adc.timer);
			g_str_app_adc.locked = DISABLE;
			g_str_app_adc.levelEnable = 0;
			g_saveCnt = 0;
			g_CurrentLevel = 0;
			break;
		case RESET_CAP:
			//FPGA_READ_CS_L;						
			g_FPGAReadyFlg = 0;
			//g_saveCnt = 0;
			g_str_app_adc.locked = ENABLE;
			//g_str_app_adc.levelEnable = 0;
			g_CapFlag = 0;			
			break;			
		case START_CAP:
			FPGA_READ_CS_L;						
			g_FPGAReadyFlg = 0;
			//g_saveCnt = 0;
			//g_str_app_adc.locked = ENABLE;
			//g_str_app_adc.levelEnable = 0;
			g_CapFlag = 1;			
			break;
		case STOP_CAP:
			g_StopFlag = 1;
			g_str_app_adc.locked = DISABLE;
			nrf_drv_timer_disable(&g_str_app_adc.timer);
			break;		
	}
}
void mainTest()
{
bool erase_bonds;
// Initialize.
SpiInit();
uart_init();   
log_init();      
timers_init();
buttons_leds_init(&erase_bonds);
power_management_init();
ble_stack_init();
gap_params_init();
gatt_init();
services_init();
advertising_init();
conn_params_init();

//throughput_test();
NRF_LOG_INFO("SPIS init");



// Start execution.
printf("\r\nUART started.\r\n");
NRF_LOG_INFO("Debug logging for UART over RTT started.");
advertising_start();

//adc init
saadc_init();
saadc_sampling_event_init();
saadc_sampling_event_enable();	
captrue_cmd(RESET_ALL);

for (;;){
	HVOL_SET_H;
	FPGA_READ_CS_L;
	nrf_delay_us(40);
	FPGA_READ_CS_H;
    idle_state_handle();
	nrf_delay_us(2000);
}
	
}
void bsp_event_callback(bsp_event_t event)
{}
/**@brief Application main function.
 */
int main(void)
{
  bool erase_bonds;
	ret_code_t err_code;
	uint16_t j;
	int32_t i;
	uint16_t g_len = MAX_BLE_BUF;

    // Initialize.
	SpiInit();
    uart_init();   
    log_init();      
    timers_init();
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    //throughput_test();
	NRF_LOG_INFO("SPIS init");
	
	 
		
    // Start execution.
    printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();
	
    //Configure WDT.
    //nrf_drv_wdt_config_t config = NRF_DRV_WDT_DEAFULT_CONFIG;
    //err_code = nrf_drv_wdt_init(&config, wdt_event_handler);
    //APP_ERROR_CHECK(err_code);
    //err_code = nrf_drv_wdt_channel_alloc(&m_channel_id);
    //APP_ERROR_CHECK(err_code);
    //nrf_drv_wdt_enable();
	
	//adc init
#ifdef Z1_RTP	
	//saadc_init2();
	//captrue_cmd(RESET_ALL);
	
#else	
	saadc_init();
    saadc_sampling_event_init();
	saadc_sampling_event_enable();
#endif
	 m_cnt_7ms = 0;
    for (;;)
    {
		//s1 over enable fpga
		if(g_CapFlag == 1){
			//printf("step1:csL\n");
			nrf_delay_us(20); 
		    FPGA_READ_CS_H;
			g_CapFlag = 2;
			
