sentervip/nrf52832sdk15.0.0/nRF5_SDK_15.0.0_a53641a/examples/ble_peripheral/tutorial_ble_app_uart/main.c
		}
#ifdef Z1_RTP		
        //s2 read fpga
		if(g_CapFlag == 2){
			//saadc_getData();
			g_saveCnt =0;
			//memset(g_save,0,50);
			for(j=0;j<MAX_SPI2APP_CNT;j++){
				SpiRead(&g_save[g_saveCnt], MAX_SPI_BUF);		 	
				g_saveCnt += MAX_SPI_BUF;	
				//for test
				//for(i=0;i<MAX_SPI_BUF;i++){
				//printf("cnt=%d,%d,%d,",j,g_save[g_saveCnt-MAX_SPI_BUF],g_save[g_saveCnt-1]);	
				nrf_delay_ms(1);
				//}
				
			}
			//printf("cnt=%d\n",g_saveCnt);
			//g_save[CAP_ONE_TIME_BUF_LEN-2] = g_levelData[0][0] >>8;
			//g_save[CAP_ONE_TIME_BUF_LEN-1] = g_levelData[0][0] &0xff;
			g_CapFlag = 3;
		}
		
		//s3 send ble		
		if( m_conn_handle != BLE_CONN_HANDLE_INVALID && g_CapFlag == 3 && !g_StopFlag){	
			for(j=0;j<(CAP_ONE_TIME_BUF_LEN * N_CAP_NODE);j+=2){
				g_save[j] = j >>8;
				g_save[j+1] = j &0xff;
			}
			
				for(j=0,i=0;j<MAX_BLE2APP_CNT;j++){	
					err_code = ble_nus_data_send(&m_nus, (uint8_t*)(&g_save[i]), &g_len, m_conn_handle); 
					if ( err_code != NRF_SUCCESS ){
						printf("ble error=%ld", err_code);
						--j;
						nrf_delay_ms(10);
						continue;// APP_ERROR_CHECK(err_code);				
					} 		
					i += MAX_BLE_BUF;
					nrf_delay_ms(5);		
				}
				captrue_cmd(RESET_ALL);
			    captrue_cmd(START_CAP);
				m_cnt_7ms++;
				printf("cnt=%d,",m_cnt_7ms);
				//nrf_delay_ms(10);				
		}else if(g_StopFlag){
			captrue_cmd(RESET_ALL);
			g_StopFlag = 0;
			m_cnt_7ms = 0;
		}
#else	
		//s2 read data
		if(g_CapFlag == 2 && g_FPGAReadyFlg){				                          
			NRF_LOG_INFO("step2:radSpi");
			for(j=0;j<MAX_SPI2APP_CNT;j++){
				//SpiRead(&g_save[g_saveCnt],MAX_SPI_BUF);
				SpiRead(&g_save[g_saveCnt], MAX_SPI_BUF);					
				//memcpy((uint8_t*) (&g_save[g_saveCnt]), g_CapBuf, MAX_SPI_BUF );
				g_saveCnt += MAX_SPI_BUF;					
			}
			if(g_str_app_adc.levelEnable != ALL_LEVEL){
				captrue_cmd(RESET_CAP);
				captrue_cmd(ENABLE_ADC);
			}
			
			//append pressure data
	  	    g_save[g_saveCnt-2] = g_levelData[1][g_CurrentLevel] >>8;
		    g_save[g_saveCnt-1] = g_levelData[1][g_CurrentLevel] &0xff;
			NRF_LOG_INFO("read offset=%d", g_saveCnt);		
		}
					
		
			
		//s3 data to ble
		if( g_saveCnt >= (CAP_ONE_TIME_BUF_LEN * N_CAP_NODE) ){  
			   if( m_conn_handle != BLE_CONN_HANDLE_INVALID ){		
					for(j=0,i=0;j<MAX_BLE2APP_CNT;j++){						
						err_code = ble_nus_data_send(&m_nus, (uint8_t*)(&g_save[i]), &g_len, m_conn_handle);
						if ( err_code != NRF_SUCCESS ){
								NRF_LOG_INFO("ble error=0x%x", err_code);
								APP_ERROR_CHECK(err_code);				
						} 		
						i += g_len;
						nrf_delay_ms(50);		
					}
					captrue_cmd(RESET_ALL);							
			  }
		 }
 #endif						
        idle_state_handle();
    }
}

